xtee6/packages/default-configuration/managementservices.wsdl

<?xml version="1.0" encoding="UTF-8" standalone="no"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:tns="http://www.example.org/centralservice/" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:sdsb="http://x-road.eu/xsd/sdsb.xsd" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    name="centralservice" targetNamespace="http://www.example.org/centralservice/">
    <wsdl:types>
        <!-- Schema for identifiers (reduced) -->
        <xsd:schema elementFormDefault="qualified"
            targetNamespace="http://x-road.eu/xsd/identifiers" xmlns="http://x-road.eu/xsd/identifiers">
            <xsd:complexType name="SdsbIdentifierType">
                <xsd:annotation>
                    <xsd:documentation>Globally unique identifier in the
                        SDSB system. Identifier consists of object type
                        specifier and list of hierarchical codes
                        (starting with code that identifiers the SDSB
                        instance).
                    </xsd:documentation>
                </xsd:annotation>
                <xsd:sequence>
                    <xsd:element minOccurs="0" ref="sdsbInstance" />
                    <xsd:element minOccurs="0" ref="memberClass" />
                    <xsd:element minOccurs="0" ref="memberCode" />
                    <xsd:element minOccurs="0" ref="subsystemCode" />
                    <xsd:element minOccurs="0" ref="serverCode" />
                    <xsd:element minOccurs="0" ref="serviceCode" />
                    <xsd:element minOccurs="0" ref="serviceVersion" />
                </xsd:sequence>
                <xsd:attribute ref="objectType" use="required" />
            </xsd:complexType>
            <xsd:simpleType name="SdsbObjectType">
                <xsd:annotation>
                    <xsd:documentation>Enumeration for SDSB identifier
                        types that can be used in requests.
                    </xsd:documentation>
                </xsd:annotation>
                <xsd:restriction base="xsd:string">
                    <xsd:enumeration value="MEMBER" />
                    <xsd:enumeration value="SUBSYSTEM" />
                    <xsd:enumeration value="SERVER" />
                    <xsd:enumeration value="SERVICE" />
                </xsd:restriction>
            </xsd:simpleType>
            <xsd:element name="sdsbInstance" type="xsd:string">
                <xsd:annotation>
                    <xsd:documentation>Identifies the SDSB instance.
                        This field is applicable to all identifier
                        types.
                    </xsd:documentation>
                </xsd:annotation>
            </xsd:element>
            <xsd:element name="memberClass" type="xsd:string">
                <xsd:annotation>
                    <xsd:documentation>Type of the member (company,
                        government institution, private person, etc.)
                    </xsd:documentation>
                </xsd:annotation>
            </xsd:element>
            <xsd:element name="memberCode" type="xsd:string">
                <xsd:annotation>
                    <xsd:documentation>Code that uniquely identifies a
                        member of given member type.
                    </xsd:documentation>
                </xsd:annotation>
            </xsd:element>
            <xsd:element name="subsystemCode" type="xsd:string">
                <xsd:annotation>
                    <xsd:documentation>Code that uniquely identifies a
                        subsystem of given SDSB member.
                    </xsd:documentation>
                </xsd:annotation>
            </xsd:element>
            <xsd:element name="serviceCode" type="xsd:string">
                <xsd:annotation>
                    <xsd:documentation>Code that uniquely identifies a
                        service offered by given SDSB member or
                        subsystem.
                    </xsd:documentation>
                </xsd:annotation>
            </xsd:element>
            <xsd:element name="serviceVersion" type="xsd:string">
                <xsd:annotation>
                    <xsd:documentation>Version of the service.
                    </xsd:documentation>
                </xsd:annotation>
            </xsd:element>
            <xsd:element name="serverCode" type="xsd:string">
                <xsd:annotation>
                    <xsd:documentation>Code that uniquely identifies
                        security server offered by a given SDSB member
                        or subsystem.
                    </xsd:documentation>
                </xsd:annotation>
            </xsd:element>
            <xsd:attribute name="objectType" type="SdsbObjectType" />
            <xsd:complexType name="SdsbClientIdentifierType">
                <xsd:complexContent>
                    <xsd:restriction base="SdsbIdentifierType">
                        <xsd:sequence>
                            <xsd:element ref="sdsbInstance" />
                            <xsd:element ref="memberClass" />
                            <xsd:element ref="memberCode" />
                            <xsd:element minOccurs="0"
                                ref="subsystemCode" />
                        </xsd:sequence>
                    </xsd:restriction>
                </xsd:complexContent>
            </xsd:complexType>
            <xsd:complexType name="SdsbServiceIdentifierType">
                <xsd:complexContent>
                    <xsd:restriction base="SdsbIdentifierType">
                        <xsd:sequence>
                            <xsd:element ref="sdsbInstance" />
                            <xsd:element ref="memberClass" />
                            <xsd:element ref="memberCode" />
                            <xsd:element minOccurs="0"
                                ref="subsystemCode" />
                            <xsd:element ref="serviceCode" />
                            <xsd:element minOccurs="0"
                                ref="serviceVersion" />
                        </xsd:sequence>
                    </xsd:restriction>
                </xsd:complexContent>
            </xsd:complexType>
            <xsd:complexType name="SdsbSecurityServerIdentifierType">
                <xsd:complexContent>
                    <xsd:restriction base="SdsbIdentifierType">
                        <xsd:sequence>
                            <xsd:element ref="sdsbInstance" />
                            <xsd:element ref="memberClass" />
                            <xsd:element ref="memberCode" />
                            <xsd:element ref="serverCode" />
                        </xsd:sequence>
                    </xsd:restriction>
                </xsd:complexContent>
            </xsd:complexType>
        </xsd:schema>

        <!-- Schema for requests (reduced) -->
        <xsd:schema xmlns="http://www.w3.org/2001/XMLSchema"
            xmlns:tns="http://x-road.eu/xsd/sdsb.xsd" targetNamespace="http://x-road.eu/xsd/sdsb.xsd"
            xmlns:id="http://x-road.eu/xsd/identifiers"
            elementFormDefault="qualified">

            <xsd:import namespace="http://x-road.eu/xsd/identifiers"
                id="id" />

            <xsd:element name="clientReg" type="tns:ClientRequestType" />
            <xsd:element name="clientRegResponse" type="tns:ClientRequestType" />

            <xsd:element name="clientDeletion" type="tns:ClientRequestType" />
            <xsd:element name="clientDeletionResponse" type="tns:ClientRequestType" />

            <xsd:element name="authCertDeletion" type="tns:authCertDeletionType" />
            <xsd:element name="authCertDeletionResponse"
                type="tns:authCertDeletionType" />

            <!-- Header fields -->
            <xsd:element name="client" type="id:SdsbClientIdentifierType" />
            <xsd:element name="service" type="id:SdsbServiceIdentifierType" />
            <xsd:element name="userId" type="xsd:string" />
            <xsd:element name="id" type="xsd:string" />
            <xsd:element name="async" type="xsd:boolean" />

            <xsd:complexType name="authCertDeletionType">
                <xsd:sequence>
                    <xsd:element name="server"
                        type="id:SdsbSecurityServerIdentifierType">
                        <xsd:annotation>
                            <xsd:documentation>Identity of this security
                                server.
                            </xsd:documentation>
                        </xsd:annotation>
                    </xsd:element>
                    <xsd:element name="authCert" type="base64Binary">
                        <xsd:annotation>
                            <xsd:documentation>Hash of the
                                authentication
                                certificate that needs to
                                be deleted
                                from the list
                                of certificates
                                authenticating this security server.
                            </xsd:documentation>
                        </xsd:annotation>
                    </xsd:element>
                </xsd:sequence>
            </xsd:complexType>
            <xsd:complexType name="ClientRequestType">
                <xsd:sequence>
                    <xsd:element name="server"
                        type="id:SdsbSecurityServerIdentifierType">
                        <xsd:annotation>
                            <xsd:documentation>Identity of this security
                                server.
                            </xsd:documentation>
                        </xsd:annotation>
                    </xsd:element>
                    <xsd:element name="client"
                        type="id:SdsbClientIdentifierType">
                        <xsd:annotation>
                            <xsd:documentation>Identity of the SDSB
                                member
                                or subsystem requesting to be a
                                client
                                of this security server
                                or who
                                needs to be deleted from the list of
                                clients of this server
                                server.
                            </xsd:documentation>
                        </xsd:annotation>
                    </xsd:element>
                </xsd:sequence>
            </xsd:complexType>
        </xsd:schema>
    </wsdl:types>

    <wsdl:message name="requestheader">
        <wsdl:part name="client" element="sdsb:client" />
        <wsdl:part name="service" element="sdsb:service" />
        <wsdl:part name="userId" element="sdsb:userId" />
        <wsdl:part name="id" element="sdsb:id" />
        <wsdl:part name="async" element="sdsb:async" />
    </wsdl:message>

    <wsdl:message name="clientReg">
        <wsdl:part element="sdsb:clientReg" name="parameters" />
    </wsdl:message>
    <wsdl:message name="clientRegResponse">
        <wsdl:part element="sdsb:clientRegResponse" name="parameters" />
    </wsdl:message>

    <wsdl:message name="clientDeletion">
        <wsdl:part element="sdsb:clientDeletion" name="parameters" />
    </wsdl:message>
    <wsdl:message name="clientDeletionResponse">
        <wsdl:part element="sdsb:clientDeletionResponse" name="parameters" />
    </wsdl:message>

    <wsdl:message name="authCertDeletion">
        <wsdl:part element="sdsb:authCertDeletion" name="parameters" />
    </wsdl:message>
    <wsdl:message name="authCertDeletionResponse">
        <wsdl:part element="sdsb:authCertDeletionResponse"
            name="parameters" />
    </wsdl:message>

    <wsdl:portType name="centralservice">
        <wsdl:operation name="clientReg">
            <wsdl:input message="tns:clientReg" />
            <wsdl:output message="tns:clientRegResponse" />
        </wsdl:operation>

        <wsdl:operation name="clientDeletion">
            <wsdl:input message="tns:clientDeletion" />
            <wsdl:output message="tns:clientDeletionResponse" />
        </wsdl:operation>

        <wsdl:operation name="authCertDeletion">
            <wsdl:input message="tns:authCertDeletion" />
            <wsdl:output message="tns:authCertDeletionResponse" />
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="centralserviceSOAP" type="tns:centralservice">
        <soap:binding style="document"
            transport="http://schemas.xmlsoap.org/soap/http" />
        <wsdl:operation name="clientReg">
            <soap:operation soapAction="" />
            <wsdl:input>
                <soap:body use="literal"/>
                <soap:header message="tns:requestheader" part="client" use="literal"/>
                <soap:header message="tns:requestheader" part="service" use="literal"/>
                <soap:header message="tns:requestheader" part="userId" use="literal"/>
                <soap:header message="tns:requestheader" part="id" use="literal"/>
                <soap:header message="tns:requestheader" part="async" use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
                <soap:header message="tns:requestheader" part="client" use="literal"/>
                <soap:header message="tns:requestheader" part="service" use="literal"/>
                <soap:header message="tns:requestheader" part="userId" use="literal"/>
                <soap:header message="tns:requestheader" part="id" use="literal"/>
                <soap:header message="tns:requestheader" part="async" use="literal"/>
            </wsdl:output>
        </wsdl:operation>

        <wsdl:operation name="clientDeletion">
            <soap:operation soapAction="" />
            <wsdl:input>
                <soap:body use="literal" />
                <soap:header message="tns:requestheader" part="client" use="literal"/>
                <soap:header message="tns:requestheader" part="service" use="literal"/>
                <soap:header message="tns:requestheader" part="userId" use="literal"/>
                <soap:header message="tns:requestheader" part="id" use="literal"/>
                <soap:header message="tns:requestheader" part="async" use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" />
                <soap:header message="tns:requestheader" part="client" use="literal"/>
                <soap:header message="tns:requestheader" part="service" use="literal"/>
                <soap:header message="tns:requestheader" part="userId" use="literal"/>
                <soap:header message="tns:requestheader" part="id" use="literal"/>
                <soap:header message="tns:requestheader" part="async" use="literal"/>
            </wsdl:output>
        </wsdl:operation>

        <wsdl:operation name="authCertDeletion">
            <soap:operation soapAction="" />
            <wsdl:input>
                <soap:body use="literal" />
                <soap:header message="tns:requestheader" part="client" use="literal"/>
                <soap:header message="tns:requestheader" part="service" use="literal"/>
                <soap:header message="tns:requestheader" part="userId" use="literal"/>
                <soap:header message="tns:requestheader" part="id" use="literal"/>
                <soap:header message="tns:requestheader" part="async" use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal" />
                <soap:header message="tns:requestheader" part="client" use="literal"/>
                <soap:header message="tns:requestheader" part="service" use="literal"/>
                <soap:header message="tns:requestheader" part="userId" use="literal"/>
                <soap:header message="tns:requestheader" part="id" use="literal"/>
                <soap:header message="tns:requestheader" part="async" use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>
    <wsdl:service name="centralservice">
        <wsdl:port binding="tns:centralserviceSOAP" name="centralserviceSOAP">
            <soap:address
                location="http://INSERT_MANAGEMENT_SERVICE_ADDRESS_HERE" />
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
